# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\GEA_Cypress_proj\NGFL\Tuning_SW\_old\NGFLUI.cywrk.Archive01\NGFLUI\NGFLUI_Vikram.cydsn\NGFLUI_Vikram.cyprj
# Date: Thu, 23 May 2019 18:32:31 GMT
#set_units -time ns
create_clock -name {CapSense_ModClk(FFB)} -period 10625 -waveform {0 5312.5} [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {SPI_SCBCLK(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {EZI2C_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {Clock_1(FFB)} -period 1666.6666666666665 -waveform {0 833.333333333333} [list [get_pins {ClockBlock/ff_div_6}] [get_pins {ClockBlock/ff_div_7}] [get_pins {ClockBlock/ff_div_8}] [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 255 511} [list]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {EZI2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 41 81} -nominal_period 1666.6666666666665 [list]


# Component constraints for C:\GEA_Cypress_proj\NGFL\Tuning_SW\_old\NGFLUI.cywrk.Archive01\NGFLUI\NGFLUI_Vikram.cydsn\TopDesign\TopDesign.cysch
# Project: C:\GEA_Cypress_proj\NGFL\Tuning_SW\_old\NGFLUI.cywrk.Archive01\NGFLUI\NGFLUI_Vikram.cydsn\NGFLUI_Vikram.cyprj
# Date: Thu, 23 May 2019 18:32:29 GMT
